app/views/carts/_cart.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 5
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 5
---
<% unless cart.line_items.empty? %>