app/views/carts/show.html.erb

<table>
	<% @cart.line_items.each do |item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 1