app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 13 May 2012 20:38:13 UTC +00:00], ["updated_at", Sun, 13 May 2012 20:38:13 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 2], ["created_at", Tue, 29 May 2012 08:11:52 UTC +00:00], ["product_id", 3], ["quantity", 1], ["updated_at", Tue, 29 May 2012 08:11:52 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-05-29 08:11:59.448513' WHERE "line_items"."id" = 4
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save